tomyqg/STM32_RTT_F107/components/DeviceDrivers/usart5.c
		return 0;
		
		
	}
	return -1;
}

int WIFI_ChangeSSID(char *SSID,char *Passwd)
{
		int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	delayMS(5);
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSSSID(SSID);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSKEY(Passwd);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_ENTM();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();	
	return 0;
}

int WIFI_ConStatus(void)
{
	int status = 0;
	status = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8); 
	printf("status : %d\n",status);
	return status;
}


#ifdef RT_USING_FINSH
#include <finsh.h>

FINSH_FUNCTION_EXPORT(AT , Into AT Mode.)
FINSH_FUNCTION_EXPORT(AT_ENTM , Into AT_ENTM Mode.)
FINSH_FUNCTION_EXPORT(AT_VER , Get version.)
FINSH_FUNCTION_EXPORT(AT_Z , Reset USR232.)

FINSH_FUNCTION_EXPORT(AT_WSSSID , Set WSSSID.)
FINSH_FUNCTION_EXPORT(AT_WSKEY , Set WSKEY.)

FINSH_FUNCTION_EXPORT(AT_WAP , Set WAP.)
FINSH_FUNCTION_EXPORT(AT_WAKEY , Set WAKEY.)
FINSH_FUNCTION_EXPORT(AT_WAKEY_Clear , Clear WAKEY.)

FINSH_FUNCTION_EXPORT(AT_TCPB_ON , Set TCP B ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDB , Set TCP B ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTB , Set TCP B PORT.)
FINSH_FUNCTION_EXPORT(AT_TCPC_ON , Set TCP C ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDC , Set TCP C ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTC , Set TCP C PORT.)

FINSH_FUNCTION_EXPORT(AT_FAPSTA_ON , Set FAPSTA ON.)
FINSH_FUNCTION_EXPORT(AT_WMODE , Set WMode AP or STA.)



FINSH_FUNCTION_EXPORT(InitTestMode , Init Test Mode.)

FINSH_FUNCTION_EXPORT(WIFI_Factory , Set WIFI ID .)

FINSH_FUNCTION_EXPORT(SendToSocketB , Send SOCKET B.)
FINSH_FUNCTION_EXPORT(SendToSocketC , Send SOCKET C.)

#endif


